app/views/posts/_form.html.erb

SELECT "authors".* FROM "authors"
---

  <%= f.collection_select :author_id, Author.all, :id, :name %>