app/controllers/posts_controller.rb

  def create
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["author_id", 1], ["created_at", "2016-01-28 16:14:23.108051"], ["updated_at", "2016-01-28 16:14:23.108051"]]

  def update
    @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "description" = ?, "author_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My edit"], ["description", "My post description"], ["author_id", 1], ["updated_at", "2016-01-28 16:18:25.631951"], ["id", 1]]